[{"leader":"Charles de Gaulle","levelNumber":1,"description":"The Fall of France 1940: Paris is lost. The government surrenders. But you refuse to give in. What do you do?","historicalChoice":"Broadcast a call to arms—France must resist!","summary":"De Gaulle broadcasted a call to arms, rallying the French to resist and forming the Free French Forces."},{"leader":"Charles de Gaulle","levelNumber":2,"description":"Free French Forces 1940-1945: You lead in exile. Many doubt your legitimacy. How do you rally support?","historicalChoice":"Build an army, gain recognition, and prove them wrong!","summary":"De Gaulle built the Free French Forces, gaining recognition through persistent leadership and military action."},{"leader":"Charles de Gaulle","levelNumber":3,"description":"Tension with Churchill and Roosevelt 1940-1944: The Allies favor other French leaders. They exclude you from decisions. How do you respond?","historicalChoice":"I demand recognition! France must speak for itself!","summary":"De Gaulle demanded recognition, ensuring France’s voice was heard despite Allied resistance."},{"leader":"Charles de Gaulle","levelNumber":4,"description":"Battle of Bir Hakeim 1942: Your Free French forces hold a key desert position. The enemy advances. What do you order?","historicalChoice":"Hold the line! Show them what Free France can do!","summary":"De Gaulle ordered his forces to hold Bir Hakeim, proving the Free French’s valor and boosting their reputation."},{"leader":"Charles de Gaulle","levelNumber":5,"description":"Invasion of North Africa 1942: The Americans land in North Africa but ignore you. What is your next move?","historicalChoice":"Negotiate, but remind them—we are the real France!","summary":"De Gaulle negotiated with the Allies, asserting the Free French’s role in North Africa."},{"leader":"Charles de Gaulle","levelNumber":6,"description":"French Resistance 1940-1945: Inside occupied France, resistance fighters risk their lives. What support do you provide?","historicalChoice":"Supply them, organize them—turn France into a battlefield!","summary":"De Gaulle supported the French Resistance, providing supplies and coordination to fight the occupation."},{"leader":"Charles de Gaulle","levelNumber":7,"description":"Liberation of Paris 1944: Paris is about to be liberated, but the Allies hesitate. Who enters first?","historicalChoice":"Order Free French forces into the city—France must free itself!","summary":"De Gaulle ordered Free French forces to liberate Paris, ensuring a symbolic victory for France."},{"leader":"Charles de Gaulle","levelNumber":8,"description":"De Gaulle’s Provisional Government 1944-1946: Liberation is not enough. You must govern. How do you secure power?","historicalChoice":"Take control—France will not be ruled by foreigners!","summary":"De Gaulle took control, establishing a provisional government to lead France post-liberation. Hint: France is free, but is it truly independent?"},{"leader":"Charles de Gaulle","levelNumber":9,"description":"The Yalta Conference 1945: The great powers shape the post-war world. But you are not invited. What do you do?","historicalChoice":"Make France heard, even if we must stand alone!","summary":"De Gaulle ensured France’s voice was heard, refusing to be sidelined at Yalta. Hint: A table of giants, but one chair remains empty. Who speaks for France?"},{"leader":"Charles de Gaulle","levelNumber":10,"description":"The end? 1946: France moves toward a new republic, but it is weak. Do you stay in power?","historicalChoice":"I will not be a powerless leader—I step down!","summary":"De Gaulle stepped down in 1946, unwilling to lead a weak government. Hint: To lead, but not to obey. A man of principle, or a man alone?"},{"leader":"Franklin D. Roosevelt","levelNumber":1,"description":"Lend-Lease Act 1941: Britain is on the brink, pleading for support. Congress is hesitant. What do you do?","historicalChoice":"We shall be the arsenal of democracy—send the aid!","summary":"Roosevelt pushed through the Lend-Lease Act, providing critical support to Britain and the Allies."},{"leader":"Franklin D. Roosevelt","levelNumber":2,"description":"Pearl Harbor 1941: Japan has struck. Thousands are dead. The nation demands action. What do you say?","historicalChoice":"A date which will live in infamy—we declare war!","summary":"Roosevelt declared war on Japan, marking the U.S. entry into WWII after Pearl Harbor."},{"leader":"Franklin D. Roosevelt","levelNumber":3,"description":"War on Germany 1941: Germany and Italy declare war on the US. How do you respond?","historicalChoice":"Then we shall fight them on all fronts!","summary":"Roosevelt committed to fighting on all fronts, engaging both Germany and Japan."},{"leader":"Franklin D. Roosevelt","levelNumber":4,"description":"The Manhattan Project 1942-1945: A secret weapon is being developed. Do you fund its continuation?","historicalChoice":"Yes, we must explore every option to end this war.","summary":"Roosevelt funded the Manhattan Project, leading to the development of the atomic bomb."},{"leader":"Franklin D. Roosevelt","levelNumber":5,"description":"The Casablanca Conference 1943: Churchill suggests \u0027unconditional surrender\u0027 for the Axis. Do you agree?","historicalChoice":"Yes! We must eliminate any future threats!","summary":"Roosevelt agreed to demand unconditional surrender, setting a firm Allied stance."},{"leader":"Franklin D. Roosevelt","levelNumber":6,"description":"D-Day Planning 1944: The invasion of France is crucial. Do you approve the operation?","historicalChoice":"It\u0027s time—give the order!","summary":"Roosevelt approved D-Day, leading to the successful invasion of Normandy."},{"leader":"Franklin D. Roosevelt","levelNumber":7,"description":"The Tehran Conference 1943: Stalin demands a second front immediately. How do you reply?","historicalChoice":"We commit—Europe will be liberated!","summary":"Roosevelt committed to opening a second front, aligning with Stalin’s demands."},{"leader":"Franklin D. Roosevelt","levelNumber":8,"description":"Fourth Term 1944: You run for an unprecedented fourth term. Do you continue?","historicalChoice":"Yes, the war isn\u0027t over—I must lead!","summary":"Roosevelt ran for a fourth term, leading the U.S. through the war’s final stages. Hint: No president had ever served this long. A wartime leader is hard to replace."},{"leader":"Franklin D. Roosevelt","levelNumber":9,"description":"The Yalta Conference 1945: Post-war plans are forming. Stalin is making demands. What is your stance?","historicalChoice":"We need Soviet support, but we must ensure democracy in Europe.","summary":"Roosevelt sought a balance, ensuring Soviet cooperation while advocating for democracy. Hint: One war is ending, another is on the horizon. Who can be trusted?"},{"leader":"Franklin D. Roosevelt","levelNumber":10,"description":"Is it really the end? 1945: You are gravely ill. The future of the war is out of your hands. What do you do?","historicalChoice":"Prepare Truman for the challenges ahead.","summary":"Roosevelt prepared Truman for leadership before his death in April 1945. Hint: A sudden change at the helm... but the war waits for no one."}]