[{"leader":"Charles de Gaulle","levelNumber":1,"description":"The Fall of France 1940: Paris is lost. The government surrenders. But you refuse to give in. What do you do?","historicalChoice":"Broadcast a call to arms—France must resist!","summary":"De Gaulle broadcasted a call to arms, rallying the French to resist and forming the Free French Forces."},{"leader":"Charles de Gaulle","levelNumber":2,"description":"Free French Forces 1940-1945: You lead in exile. Many doubt your legitimacy. How do you rally support?","historicalChoice":"Build an army, gain recognition, and prove them wrong!","summary":"De Gaulle built the Free French Forces, gaining recognition through persistent leadership and military action."},{"leader":"Charles de Gaulle","levelNumber":3,"description":"Tension with Churchill and Roosevelt 1940-1944: The Allies favor other French leaders. They exclude you from decisions. How do you respond?","historicalChoice":"I demand recognition! France must speak for itself!","summary":"De Gaulle demanded recognition, ensuring France’s voice was heard despite Allied resistance."},{"leader":"Charles de Gaulle","levelNumber":4,"description":"Battle of Bir Hakeim 1942: Your Free French forces hold a key desert position. The enemy advances. What do you order?","historicalChoice":"Hold the line! Show them what Free France can do!","summary":"De Gaulle ordered his forces to hold Bir Hakeim, proving the Free French’s valor and boosting their reputation."},{"leader":"Charles de Gaulle","levelNumber":5,"description":"Invasion of North Africa 1942: The Americans land in North Africa but ignore you. What is your next move?","historicalChoice":"Negotiate, but remind them—we are the real France!","summary":"De Gaulle negotiated with the Allies, asserting the Free French’s role in North Africa."},{"leader":"Charles de Gaulle","levelNumber":6,"description":"French Resistance 1940-1945: Inside occupied France, resistance fighters risk their lives. What support do you provide?","historicalChoice":"Supply them, organize them—turn France into a battlefield!","summary":"De Gaulle supported the French Resistance, providing supplies and coordination to fight the occupation."},{"leader":"Charles de Gaulle","levelNumber":7,"description":"Liberation of Paris 1944: Paris is about to be liberated, but the Allies hesitate. Who enters first?","historicalChoice":"Order Free French forces into the city—France must free itself!","summary":"De Gaulle ordered Free French forces to liberate Paris, ensuring a symbolic victory for France."},{"leader":"Charles de Gaulle","levelNumber":8,"description":"De Gaulle’s Provisional Government 1944-1946: Liberation is not enough. You must govern. How do you secure power?","historicalChoice":"Take control—France will not be ruled by foreigners!","summary":"De Gaulle took control, establishing a provisional government to lead France post-liberation. Hint: France is free, but is it truly independent?"},{"leader":"Charles de Gaulle","levelNumber":9,"description":"The Yalta Conference 1945: The great powers shape the post-war world. But you are not invited. What do you do?","historicalChoice":"Make France heard, even if we must stand alone!","summary":"De Gaulle ensured France’s voice was heard, refusing to be sidelined at Yalta. Hint: A table of giants, but one chair remains empty. Who speaks for France?"},{"leader":"Charles de Gaulle","levelNumber":10,"description":"The end? 1946: France moves toward a new republic, but it is weak. Do you stay in power?","historicalChoice":"I will not be a powerless leader—I step down!","summary":"De Gaulle stepped down in 1946, unwilling to lead a weak government. Hint: To lead, but not to obey. A man of principle, or a man alone?"},{"leader":"Joseph Stalin","levelNumber":1,"description":"Operation Barbarossa 1941: The Germans have launched a surprise invasion. Cities burn, and chaos spreads. Reports flood in, but your generals hesitate, waiting for your command. How do you respond?","historicalChoice":"We hold our ground and mobilize immediately!","summary":"Stalin initially hesitated, believing the invasion was misinformation, but mobilization was the historical response that began the Soviet defense."},{"leader":"Joseph Stalin","levelNumber":2,"description":"Scorched Earth policy 1941-1942: The Germans advance deeper into Soviet territory. We can retreat, but we cannot leave anything behind. How do we slow the enemy?","historicalChoice":"Burn the land, destroy the resources—let them starve!","summary":"Stalin ordered the scorched-earth policy, destroying resources to hinder the German advance."},{"leader":"Joseph Stalin","levelNumber":3,"description":"Siege of Leningrad 1941-1944: Leningrad is surrounded. Millions of civilians are trapped. The winter is deadly. Your people look to you. What is your order?","historicalChoice":"No surrender! Hold the city at any cost!","summary":"Stalin ordered Leningrad to hold at all costs, leading to a prolonged and brutal siege but ultimately preserving Soviet morale."},{"leader":"Joseph Stalin","levelNumber":4,"description":"Moscow is in your hands 1941-1942: The enemy is at the gates of Moscow. Your capital is under threat. Some advise you to flee. What do you decide?","historicalChoice":"I stay in Moscow. If I run, the nation falls!","summary":"Stalin chose to stay in Moscow, boosting morale and leading to a successful defense of the capital."},{"leader":"Joseph Stalin","levelNumber":5,"description":"Stalingrad counteroffensive 1942-1943: The battle for Stalingrad is brutal. The German army is overextended. How do you strike?","historicalChoice":"Encircle them! Cut off their supplies and starve them!","summary":"Stalin approved Operation Uranus, encircling the Germans at Stalingrad, leading to a major turning point in the war."},{"leader":"Joseph Stalin","levelNumber":6,"description":"Kursk Tank battle 1943: Hitler\u0027s forces launch an all-out tank offensive at Kursk. Your commanders propose different plans. What is your strategy?","historicalChoice":"Let them come—our defenses will break them, then we strike!","summary":"Stalin opted for a defensive strategy at Kursk, allowing the Germans to exhaust themselves before launching a counteroffensive."},{"leader":"Joseph Stalin","levelNumber":7,"description":"Soviet Partisan warfare 1941-1945: Behind enemy lines, Soviet partisans fight in forests and towns. What orders do you give?","historicalChoice":"Sabotage their supply lines—turn the land against them!","summary":"Stalin supported partisan warfare, ordering sabotage that disrupted German supply lines and morale."},{"leader":"Joseph Stalin","levelNumber":8,"description":"Tehran Conference 1943: You sit with Churchill and Roosevelt. The West delays opening a second front. You need them to act. What do you demand?","historicalChoice":"Open a Western Front now! The Red Army cannot fight alone!","summary":"Stalin demanded a second front, pressuring the Allies to act. Hint: The West hesitated, but the Red Army bled. A demand had to be made."},{"leader":"Joseph Stalin","levelNumber":9,"description":"Berlin\u0027s fate 1945: The Red Army is at the doorstep of Berlin. The Western Allies are close. Who gets there first is critical. What do you command?","historicalChoice":"Storm the city—raise the Soviet flag over the Reichstag!","summary":"Stalin ordered the Red Army to storm Berlin, raising the Soviet flag over the Reichstag in a symbolic victory. Hint: A race to the Reichstag, but..."},{"leader":"Joseph Stalin","levelNumber":10,"description":"Yalta Conference 1945: The war is ending, but the world is changing. Churchill and Roosevelt want a say in Europe\u0027s future. What is your stance?","historicalChoice":"The USSR must control Eastern Europe—we have sacrificed the most!","summary":"Stalin insisted on Soviet control over Eastern Europe, shaping the post-war landscape. Hint: Is victory lost at the negotiation table?"}]